/* Sample PL/I Program */
SAMPLE_PROC: PROCEDURE(X FIXED, Y CHAR(10));
  DECLARE I FIXED;
  DECLARE MSG CHAR(20) = 'Hello, World!';

  PUT LIST('Starting procedure');

  DO I = 1 TO 10;
    PUT LIST('Iteration: ', I);
  END;

  RETURN;
END SAMPLE_PROC;

/* Main program */
DECLARE NUM FIXED = 42;
DECLARE NAME CHAR(20) = 'PL/I Parser';

PUT LIST('Program: ', NAME);
PUT LIST('Number: ', NUM);

CALL SAMPLE_PROC(NUM, 'test');
