/* Sample PL/I program */
DCL A FIXED(31);
DCL B FIXED(31);
DCL C FIXED(31);

A = 10;
B = 20;
C = A + B;

PUT SKIP LIST('The result of A + B is:', C);